Repository: blog2i2j/NickvisionApps.._..Parabolic
Catalog: resources/po/*.po
Languages: kk

source: Add Download
kk: Жүктеп алуды қосу

source: Discover
kk: Шолу

source: Media URL
kk: Медиа URL-адресі

source: Select Batch File
kk: Пакеттік файлды таңдау

source: Use Authentication
kk: Аутентификацияны қолдану

source: Credential
kk: Тіркелгі мәліметі

source: Username
kk: Пайдаланушы аты

source: Password
kk: Пароль

source: Download Immediately
kk: Дереу жүктеп алу

source: Media will be downloaded based off of previously configured options and sensible defaults. Options will not be shown
kk: Медиа бұрын бапталған опциялар мен мағыналы әдепкі баптаулар негізінде жүктеледі. Опциялар көрсетілмейді

source: Discovering Media
kk: Медианы шолу

source: This may take some time...
kk: Бұл біраз уақыт алуы мүмкін...

source: Configure
kk: Баптау

source: Search Subtitles
kk: Субтитрлерді іздеу

source: Download
kk: Жүктеп алу

source: General
kk: Жалпы

source: File Name
kk: Файл аты

source: Revert to Title
kk: Атауына қайтару

source: Save Folder
kk: Сақтау бумасы

source: Select Save Folder
kk: Сақтау бумасын таңдау

source: File Type
kk: Файл түрі

source: Generic types do not support embedding thumbnails and subtitles.
kk: Жалпы түрлер эскиздер мен субтитрлерді кірістіруді қолдамайды.

source: Video Format
kk: Видео пішімі

source: Audio Format
kk: Аудио пішімі

source: Subtitles
kk: Субтитрлер

source: Search subtitles
kk: Субтитрлерді іздеу

source: Available Subtitles
kk: Қолжетімді субтитрлер

source: Deselect All
kk: Барлығынан таңдауды алып тастау

source: Select All
kk: Барлығын таңдау

source: Advanced
kk: Кеңейтілген

source: Options
kk: Опциялар

source: Split into Files by Chapters
kk: Бөлімдер бойынша файлдарға бөлу

source: Export Description to File
kk: Сипаттаманы файлға экспорттау

source: Exclude from History
kk: Тарихтан шығарып тастау

source: Post Processor Argument
kk: Пост-өңдеуші аргументі

source: Arguments are configurable in Preferences
kk: Аргументтерді баптауларда реттеуге болады

source: Start Time
kk: Басталу уақыты

source: End Time
kk: Аяқталу уақыты

source: Suggested Video Resolution
kk: Ұсынылатын видео ажыратымдылығы

source: Suggested Audio Bitrate
kk: Ұсынылатын аудио битрейті

source: Items
kk: Элементтер

source: Reverse Download Order
kk: Жүктеу ретін кері етіп өзгерту

source: Number Titles
kk: Атауларды нөмірлеу

source: Numbering will be applied to titles of selected items in succession on download
kk: Жүктеу кезінде нөмірлеу таңдалған элементтердің атауларына ретімен іске асырылады

source: Available Items
kk: Қолжетімді элементтер

source: Note: Some playlist items may not contain subtitles for a selected language.
kk: Ескертпе: Ойнату тізімінің кейбір элементтерінде таңдалған тіл үшін субтитрлер болмауы мүмкін.

source: Export M3U Playlist File
kk: M3U ойнату тізімі файлын экспорттау

source: View Log
kk: Журналды қарау

source: Pause
kk: Аялдату

source: Stop
kk: Тоқтату

source: Play
kk: Ойнату

source: Open
kk: Ашу

source: Retry
kk: Қайталау

source: Copy Log to Clipboard
kk: Журналды алмасу буферіне көшіру

source: History
kk: Тарих

source: Sort By
kk: Сұрыптау реті

source: Newest
kk: Ең жаңа

source: Oldest
kk: Ең ескі

source: Save Length
kk: Сақтау ұзақтығы

source: Clear All
kk: Барлығын тазалау

source: Keyring
kk: Кілттер бауы

source: Credentials
kk: Тіркелгі мәліметтері

source: Add
kk: Қосу

source: Name
kk: Аты

source: Loading
kk: Жүктелуде

source: Preferences
kk: Баптаулар

source: Keyboard Shortcuts
kk: Пернетақта жарлықтары

source: About Parabolic
kk: Parabolic туралы

source: Stop All Remaining
kk: Қалғандардың барлығын тоқтату

source: Retry All Failed
kk: Сәтсіз аяқталғандардың барлығын қайталау

source: Clear All Queued
kk: Кезекте тұрғандардың барлығын тазалау

source: Clear All Completed
kk: Аяқталғандардың барлығын тазалау

source: Main Menu
kk: Негізгі мәзір

source: Updater
kk: Жаңарту құралы

source: Download Media
kk: Медианы жүктеп алу

source: Add a video, audio, or playlist URL to start downloading
kk: Жүктеуді бастау үшін видео, аудио немесе ойнату тізімінің URL-адресін қосыңыз

source: All
kk: Барлығы

source: Running
kk: Орындалуда

source: Queued
kk: Кезекте

source: Completed
kk: Аяқталды

source: Manage Download
kk: Жүктеуді басқару

source: No Downloads
kk: Жүктемелер жоқ

source: There are no downloads of this type
kk: Мұндай түрдегі жүктемелер жоқ

source: User Interface
kk: Пайдаланушы интерфейсі

source: Theme
kk: Тема

source: Translation Language
kk: Аударма тілі

source: An application restart is required for a change to take effect
kk: Өзгерістер күшіне енуі үшін қолданбаны қайта іске қосу қажет

source: Receive Preview Updates
kk: Алдын ала қарау жаңартуларын алу

source: Update dependencies, such as yt-dlp, to beta versions
kk: yt-dlp сияқты тәуелділіктерді бета-нұсқаларға дейін жаңарту

source: Prevent Suspend
kk: Күту режимін болдырмау

source: Prevent the computer from sleeping while downloads are running
kk: Жүктемелер орындалып жатқанда компьютердің ұйқы режиміне өтуін болдырмау

source: Download History Length
kk: Жүктеу тарихының ұзақтығы

source: The amount of time to keep past downloads in the app's history
kk: Алдыңғы жүктемелерді қолданба тарихында сақтау уақыты

source: Downloads
kk: Жүктемелер

source: Max Number of Running Downloads
kk: Орындалып жатқан жүктемелердің максималды саны

source: Overwrite Existing Files
kk: Бар файлдарды қайта жазу

source: Limit Filename Characters
kk: Файл атындағы таңбаларды шектеу

source: Restrict characters in filenames to those supported only by Windows
kk: Файл аттарындағы таңбаларды тек Windows қолдайтындармен шектеу

source: Include Media Id in Title
kk: Атауға медиа ID-ін қосу

source: Add the media's id to its default title
kk: Медиа ID-ін оның әдепкі атауына қосу

source: Include Auto-Generated Subtitles
kk: Автоматты түрде жасалған субтитрлерді қосу

source: Show auto-generated subtitles to download in addition to available subtitles
kk: Қолжетімді субтитрлерге қоса, жүктеп алу үшін автоматты түрде жасалған субтитрлерді көрсету

source: Preferred Video Codec
kk: Таңдаулы видео кодегі

source: Prefer this codec when parsing video formats to show available to download
kk: Жүктеп алу үшін қолжетімді видео пішімдерін талдау кезінде осы кодекке басымдық беру

source: Preferred Audio Codec
kk: Таңдаулы аудио кодегі

source: Prefer this codec when parsing audio formats to show available to download
kk: Жүктеп алу үшін қолжетімді аудио пішімдерін талдау кезінде осы кодекке басымдық беру

source: Preferred Subtitle Format
kk: Таңдаулы субтитр пішімі

source: Prefer this subtitle file format when downloading
kk: Жүктеп алу кезінде осы субтитр файлының пішіміне басымдық беру

source: Downloader
kk: Жүктеуші

source: Use Part Files
kk: Бөлшек файлдарды қолдану

source: Download media in separate .part files instead of directly into the output file
kk: Медианы тікелей шығыс файлына емес, бөлек .part файлдарына жүктеп алу

source: Use SponsorBlock for YouTube
kk: YouTube үшін SponsorBlock қолдану

source: Try to remove sponsored segments from videos
kk: Видеолардан демеушілік сегменттерді жоюға тырысу

source: Limit Download Speed
kk: Жүктеу жылдамдығын шектеу

source: Speed Limit (KiB/s)
kk: Жылдамдық шегі (КиБ/с)

source: Proxy URL
kk: Прокси URL-адресі

source: Cookies File
kk: Cookies файлы

source: Select Cookies File
kk: Cookies файлын таңдау

source: Clear Cookies File
kk: Cookies файлын тазалау

source: Cookies from Browser
kk: Браузерден алынған Cookies

source: An alternative downloader that may be faster in some regions compared to yt-dlp's native downloader
kk: Кейбір аймақтарда yt-dlp-нің стандартты жүктеушісіне қарағанда жылдамырақ болуы мүмкін балама жүктеуші

source: Use aria2c
kk: aria2c қолдану

source: Max Connections Per Server (-x)
kk: Серверге шаққандағы максималды қосылымдар саны (-x)

source: Minimum Split Size (-k)
kk: Минималды бөлу өлшемі (-k)

source: The minimum size of which to split a file (in MiB)
kk: Файлды бөлудің минималды өлшемі (МиБ)

source: Specify extra arguments to pass to yt-dlp
kk: yt-dlp-ге берілетін қосымша аргументтерді көрсетіңіз

source: yt-dlp Discovery Arguments
kk: yt-dlp шолу аргументтері

source: yt-dlp Download Arguments
kk: yt-dlp жүктеу аргументтері

source: Converter
kk: Түрлендіргіш

source: Embed Metadata
kk: Метадеректерді кірістіру

source: Remove Source Data
kk: Бастапқы деректерді өшіру

source: Clear metadata fields containing identifying download information
kk: Жүктеу туралы сәйкестендіру ақпараты бар метадеректер өрістерін тазалау

source: Embed Thumbnails
kk: Эскиздерді кірістіру

source: If the file type does not support embedding, the thumbnail will be written to a separate image file
kk: Егер файл түрі кірістіруді қолдамаса, эскиз бөлек сурет файлына жазылады

source: Crop Audio Thumbnails
kk: Аудио эскиздерін қию

source: Crop thumbnails of audio files to squares
kk: Аудио файлдардың эскиздерін шаршы етіп қию

source: Embed Chapters
kk: Бөлімдерді кірістіру

source: Embed Subtitles
kk: Субтитрлерді кірістіру

source: If disabled or if embedding is not supported, downloaded subtitles will be saved to separate files
kk: Егер сөндірулі болса немесе кірістіру қолданылмаса, жүктелген субтитрлер бөлек файлдарда сақталады

source: FFmpeg Threads
kk: FFmpeg ағындары

source: Limit the number of threads used by ffmpeg
kk: ffmpeg қолданатын ағындар санын шектеу

source: Postprocessing Arguments
kk: Пост-өңдеу аргументтері

source: Arguments will be shown for selection in the add download dialog
kk: Аргументтер жүктеуді қосу сұхбат терезесінде таңдау үшін көрсетіледі

source: Add Postprocessing Argument
kk: Пост-өңдеу аргументін қосу

source: Argument
kk: Аргумент

source: Post Processor
kk: Пост-өңдеуші

source: Executable
kk: Орындалатын файл

source: Args
kk: Аргументтер

# Shortcut
source: Application
kk: Қолданба

source: About Application
kk: Қолданба туралы

source: Quit
kk: Шығу

source: Folder
kk: Бума

source: Open Folder
kk: Буманы ашу

source: Close Folder
kk: Буманы жабу

source: Starting
kk: Басталуда

source: Unknown
kk: Белгісіз

source: Error
kk: Қате

source: Success
kk: Сәтті

source: Paused
kk: Аялдатылды

source: Resume
kk: Жалғастыру

source: Processing
kk: Өңдеу

source: Sleeping for {0}
kk: {0} бойы күтуде

source: {0}% Complete • {1} • {2} Remaining
kk: {0}% аяқталды • {1} • {2} қалды

source: Stopped
kk: Тоқтатылды

source: TXT Files (*.txt)
kk: TXT файлдары (*.txt)

source: No Subtitles Available
kk: Қолжетімді субтитрлер жоқ

source: Properties
kk: Қасиеттер

source: Clear All History?
kk: Барлық тарихты тазалау керек пе?

source: Are you sure you want to clear all download history? This action is irreversible
kk: Барлық жүктемелер тарихын тазалағыңыз келетініне сенімдісіз бе? Бұл әрекетті болдырмау мүмкін емес

source: Clear
kk: Тазалау

source: Cancel
kk: Бас тарту

source: Download Again
kk: Қайта жүктеп алу

source: Delete
kk: Өшіру

source: Downloaded On: {0}
kk: Жүктелген күні: {0}

source: No History
kk: Тарих жоқ

source: Edit
kk: Түзету

source: No Credentials
kk: Тіркелгі мәліметтері жоқ

source: OK
kk: ОК

source: Delete Credential?
kk: Тіркелгі мәліметін өшіру керек пе?

source: Are you sure you want to delete this credential? This action is irreversible
kk: Осы тіркелгі мәліметін өшіргіңіз келетініне сенімдісіз бе? Бұл әрекетті болдырмау мүмкін емес

source: Don't show this message again
kk: Бұл хабарды қайта көрсетпеу

source: Legal Copyright Disclaimer
kk: Авторлық құқық туралы заңды ескерту

source: Videos on YouTube and other sites may be subject to DMCA protection. The authors of Parabolic do not endorse, and are not responsible for, the use of this application in means that will violate these laws.
kk: YouTube және басқа сайттардағы видеолар DMCA қорғауында болуы мүмкін. Parabolic авторлары бұл қолданбаны осы заңдарды бұзатын мақсаттарда қолдануды құптамайды және оған жауапты емес.

source: I understand
kk: Түсіндім

source: Recover Downloads?
kk: Жүктемелерді қалпына келтіру керек пе?

source: There are downloads available to recover from when Parabolic crashed. Would you like to download them again?
kk: Parabolic қатемен жабылған кезде қалпына келтіруге болатын жүктемелер бар. Оларды қайта жүктеп алғыңыз келе ме?

source: Yes
kk: Иә

source: No
kk: Жоқ

source: There are downloads still in progress. Would you like to stop them and exit?
kk: Жүктемелер әлі орындалуда. Оларды тоқтатып, шыққыңыз келе ме?

source: Update
kk: Жаңарту

source: Downloading update: {0}%
kk: Жаңарту жүктелуде: {0}%

source: Details
kk: Толығырақ

source: Close
kk: Жабу

source: GitHub Repo
kk: GitHub репозиторийі

source: No file selected
kk: Файл таңдалмады

source: No Arguments
kk: Аргументтер жоқ

source: Delete Argument?
kk: Аргументті өшіру керек пе?

source: Are you sure you want to delete this post-processor argument? This action is irreversible
kk: Осы пост-өңдеуші аргументін өшіргіңіз келетініне сенімдісіз бе? Бұл әрекетті болдырмау мүмкін емес

source: Use manual credential
kk: Тіркелгі мәліметтерін қолмен енгізу

source: None
kk: Ешқандай

source: An error occurred while adding playlist downloads
kk: Ойнату тізіміндегі жүктемелерді қосу кезінде қате орын алды

source: An error occurred while adding the single download
kk: Жеке жүктеуді қосу кезінде қате орын алды

source: No media was found at the provided URL
kk: Көрсетілген URL-адрестен медиа табылмады

source: Worst
kk: Ең нашар

source: Best
kk: Ең жақсы

source: Video (Generic)
kk: Видео (жалпы)

source: MP4 (Video)
kk: MP4 (видео)

source: WEBM (Video)
kk: WEBM (видео)

source: MKV (Video)
kk: MKV (видео)

source: MOV (Video)
kk: MOV (видео)

source: AVI (Video)
kk: AVI (видео)

source: Audio (Generic)
kk: Аудио (жалпы)

source: MP3 (Audio)
kk: MP3 (аудио)

source: M4A (Audio)
kk: M4A (аудио)

source: OPUS (Audio)
kk: OPUS (аудио)

source: FLAC (Audio)
kk: FLAC (аудио)

source: WAV (Audio)
kk: WAV (аудио)

source: OGG (Audio)
kk: OGG (аудио)

source: An error occurred while discovering media
kk: Медианы шолу кезінде қате орын алды

source: A credential with that name already exists
kk: Мұндай атаулы тіркелгі мәліметі бұрыннан бар

source: The name of the credential cannot be empty
kk: Тіркелгі мәліметінің аты бос болмауы керек

source: Either the credential username or password must be set
kk: Тіркелгінің пайдаланушы аты немесе паролі орнатылуы керек

source: A credential with that name does not exist
kk: Мұндай атаулы тіркелгі мәліметі жоқ

source: Download web video and audio.
kk: Веб-видео мен аудионы жүктеп алу.

source: Matrix Chat
kk: Matrix чаты

source: Contributors on GitHub ❤️
kk: GitHub-тағы үлес қосушылар ❤️

source: translation-credits
kk: Baurzhan Muftakhidinov <baurthefirst@gmail.com>

source: New {0} update available: {1}
kk: Жаңа {0} жаңартуы қолжетімді: {1}

source: New yt-dlp update available: {0}
kk: Жаңа yt-dlp жаңартуы қолжетімді: {0}

source: No update available
kk: Жаңартулар жоқ

source: An error occurred while clearing completed downloads
kk: Аяқталған жүктемелерді тазалау кезінде қате орын алды

source: An error occurred while clearing recoverable downloads
kk: Қалпына келтіруге болатын жүктемелерді тазалау кезінде қате орын алды

source: An error occurred while clearing queued downloads
kk: Кезектегі жүктемелерді тазалау кезінде қате орын алды

source: An error occurred while pausing the download
kk: Жүктеуді аялдату кезінде қате орын алды

source: An error occurred while recovering downloads
kk: Жүктемелерді қалпына келтіру кезінде қате орын алды

source: An error occurred while resuming the download
kk: Жүктеуді жалғастыру кезінде қате орын алды

source: An error occurred while retrying failed downloads
kk: Сәтсіз жүктемелерді қайталау кезінде қате орын алды

source: An error occurred while retrying the download
kk: Жүктеуді қайталау кезінде қате орын алды

source: An error occurred while stopping all downloads
kk: Барлық жүктмелерді тоқтату кезінде қате орын алды

source: An error occurred while stopping the download
kk: Жүктеуді тоқтату кезінде қате орын алды

source: Unable to download and install the update
kk: Жаңартуды жүктеп алу және орнату мүмкін емес

source: yt-dlp {0} installed successfully
kk: yt-dlp {0} сәтті орнатылды

source: Unable to download and install the yt-dlp update
kk: yt-dlp жаңартуын жүктеп алу және орнату мүмкін емес

source: Any
kk: Кез келген

source: System
kk: Жүйелік

source: Never
kk: Ешқашан

source: 1 Day
kk: 1 күн

source: 1 Week
kk: 1 апта

source: 1 Month
kk: 1 ай

source: 3 Months
kk: 3 ай

source: 6 Months
kk: 6 ай

source: 1 Year
kk: 1 жыл

source: Forever
kk: Мәңгі

# Theme
source: Light
kk: Ашық

# Theme
source: Dark
kk: Күңгірт

# Theme
source: System
kk: Жүйелік

source: An argument with that name already exists
kk: Мұндай атаулы аргумент бұрыннан бар

source: The name of the argument cannot be empty
kk: Аргументтің аты бос болмауы керек

source: The arguments of the argument cannot be empty
kk: Аргументтің мәндері бос болмауы керек

source: An argument with that name does not exist
kk: Мұндай атаулы аргумент жоқ

source: The file already exists and overwriting is disabled.
kk: Файл бұрыннан бар және қайта жазу сөндірулі.

source: Starting download...
kk: Жүктеу басталуда...

source: {0:0.00} GiB
kk: {0:0.00} ГиБ

source: {0:0.00} MiB
kk: {0:0.00} МиБ

source: {0:0.00} KiB
kk: {0:0.00} КиБ

source: {0:0.00} B
kk: {0:0.00} Б

source: {0} (Auto-generated)
kk: {0} (Автоматты түрде жасалған)

source: About {0}
kk: {0} туралы

source: Changelog
kk: Өзгерістер журналы

source: Debugging
kk: Жөндеу

source: Credits
kk: Алғыстар

source: Copy Debug Information
kk: Жөндеу ақпаратын көшіру

source: Developers: {0} Designers: {1} Artists: {2}
kk: Әзірлеушілер: {0} Дизайнерлер: {1} Суретшілер: {2}

source: Developers: {0} Designers: {1} Artists: {2} Translators: {3}
kk: Әзірлеушілер: {0} Дизайнерлер: {1} Суретшілер: {2} Аудармашылар: {3}

source: Log
kk: Журнал

source: Enter media url here
kk: Медиа URL-адресін осында енгізіңіз

source: Enter username here
kk: Пайдаланушы атын осында енгізіңіз

source: Enter password here
kk: Парольді осында енгізіңіз

source: Warning
kk: Ескерту

source: Parabolic will download media based off of previously configured options and sensible defaults. Options including save folder, format, and subtitle selection will not be shown.
kk: Parabolic медианы бұрын теңшелген опциялар мен мағыналы әдепкі баптаулар негізінде жүктейді. Сақтау бумасы, пішім және субтитр таңдау сияқты опциялар көрсетілмейді.

source: Generic types do not support embedding thumbnails and subtitles. If necessary, please select a specific type that is known to support embedding to prevent separate files from being written.
kk: Жалпы түрлер эскиздер мен субтитрлерді кірістіруді қолдамайды. Қажет болса, бөлек файлдардың жазылуын болдырмау үшін кірістіруді қолдайтын арнайы түрді таңдаңыз.

source: No Subtitles
kk: Субтитрлер жоқ

source: No subtitles were found for this media.
kk: Бұл медиа үшін субтитрлер табылмады.

source: Numbering will be applied to titles of selected items in succession on download.
kk: Жүктеу кезінде нөмірлеу таңдалған элементтердің атауларына ретімен іске асырылады.

source: No subtitles were found in this playlist.
kk: Бұл ойнату тізімінде субтитрлер табылмады.

source: Configure Download
kk: Жүктеуді батау

source: Sort
kk: Сұрыптау

source: Search...
kk: Іздеу...

source: Please wait...
kk: Күте тұрыңыз...

source: There are no downloads in your history
kk: Тарихыңызда жүктемелер жоқ

source: There are no downloads found with the current filters
kk: Ағымдағы сүзгілермен жүктемелер табылмады

source: There are no credentials in your keyring
kk: Кілттер бауында тіркелгі мәліметтері жоқ

source: There are no credentials found with the current filters
kk: Ағымдағы сүзгілермен тіркелгі мәліметтері табылмады

source: Enter name here
kk: Атын осында енгізіңіз

source: Enter url here
kk: URL-адресін осында енгізіңіз

source: Preview
kk: Алдын ала қарау

source: Home
kk: Басты бет

source: Updating
kk: Жаңартылуда

source: Help
kk: Көмек

source: Check for Updates
kk: Жаңартуларды тексеру

source: Report a Bug
kk: Қате туралы хабарлау

source: Discussions
kk: Талқылаулар

source: Settings
kk: Баптаулар

source: Credential Required
kk: Тіркелгі мәліметі қажет

source: Submit
kk: Жіберу

source: A credential is required to continue the download of "{0}".
kk: "{0}" жүктеуін жалғастыру үшін тіркелгі мәліметі қажет.

source: Update Parabolic and dependencies, such as yt-dlp, to beta versions
kk: Parabolic және yt-dlp сияқты тәуелділіктерді бета-нұсқаларға дейін жаңарту

source: On
kk: Қосулы

source: Off
kk: Сөндірулі

source: Max Number of Active Downloads
kk: Белсенді жүктемелердің максималды саны

source: Speed Limit
kk: Жылдамдық шегі

source: Enter proxy url here
kk: Прокси URL-адресін осында енгізіңіз

source: Cookies from File
kk: Файлдан алынған Cookies

source: Max Connections Per Server
kk: Серверге шаққандағы максималды қосылымдар саны

source: Corresponds to -x option
kk: -x опциясына сәйкес келеді

source: Minimum Split Size (MiB)
kk: Минималды бөлу өлшемі (МиБ)

source: Corresponds to -k option
kk: -k опциясына сәйкес келеді

source: Extra arguments to pass to yt-dlp when discovering media
kk: Медианы барлау кезінде yt-dlp-ге берілетін қосымша аргументтер

source: Enter args here
kk: Аргументтерді осында енгізіңіз

source: Extra arguments to pass to yt-dlp when downloading media
kk: Медианы жүктеу кезінде yt-dlp-ге берілетін қосымша аргументтер

source: Post-Processor Arguments
kk: Пост-өңдеуші аргументтері

source: Post-Processor
kk: Пост-өңдеуші
